:PROPERTIES:
:ID:       3ccc47f9-6f09-4a75-926c-595086108348
:END:
#+TITLE: Meow

- [2021-12-05 Sun 18:05] -> https://www.youtube.com/watch?v=HhuAlAcWWeU


* Meeow Mode State List

#+begin_src emacs-lisp :tangle "meow.el"
(add-to-list 'meow-mode-state-list '(zeek-mode . normal))
(add-to-list 'meow-mode-state-list '(notdeft-mode . normal))
(add-hook 'notdeft-mode-hook (lambda () (meow-insert-mode 1)))
#+end_src

#+RESULTS:
| meow-insert-mode | meow-insert | t |

